## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

-       node_config {
-           disk_size_gb      = 10 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "cinema"
-               "node_pool"    = "core"
            } -> null
-           local_ssd_count   = 1 -> null
-           machine_type      = "n2-highcpu-4" -> null
-           metadata          = {
-               "cluster_name"             = "cinema"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "core"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = true -> null
-           service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-cinema",
-               "gke-cinema-core",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       node_pool {
-           initial_node_count          = 2 -> null
-           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-460bd46f-grp",
            ] -> null
-           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-460bd46f-grp",
            ] -> null
-           max_pods_per_node           = 65 -> null
-           name                        = "core" -> null
-           node_count                  = 2 -> null
-           node_locations              = [
-               "us-central1-a",
            ] -> null
-           version                     = "1.24.3-gke.2100" -> null

-           autoscaling {
-               max_node_count       = 4 -> null
-               min_node_count       = 2 -> null
-               total_max_node_count = 0 -> null
-               total_min_node_count = 0 -> null
            }

-           management {
-               auto_repair  = true -> null
-               auto_upgrade = true -> null
            }

-           node_config {
-               disk_size_gb      = 10 -> null
-               disk_type         = "pd-standard" -> null
-               guest_accelerator = [] -> null
-               image_type        = "COS_CONTAINERD" -> null
-               labels            = {
-                   "cluster_name" = "cinema"
-                   "node_pool"    = "core"
                } -> null
-               local_ssd_count   = 1 -> null
-               machine_type      = "n2-highcpu-4" -> null
-               metadata          = {
-                   "cluster_name"             = "cinema"
-                   "disable-legacy-endpoints" = "true"
-                   "node_pool"                = "core"
                } -> null
-               oauth_scopes      = [
-                   "https://www.googleapis.com/auth/logging.write",
-                   "https://www.googleapis.com/auth/monitoring",
                ] -> null
-               preemptible       = true -> null
-               service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com" -> null
-               spot              = false -> null
-               tags              = [
-                   "gke-cinema",
-                   "gke-cinema-core",
                ] -> null
-               taint             = [] -> null

-               shielded_instance_config {
-                   enable_integrity_monitoring = true -> null
-                   enable_secure_boot          = false -> null
                }

-               workload_metadata_config {
-                   mode = "GKE_METADATA" -> null
                }
            }

-           upgrade_settings {
-               max_surge       = 1 -> null
-               max_unavailable = 0 -> null
            }
        }

        # (17 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] has been deleted
-   resource "google_container_node_pool" "pools" {
-       cluster            = "cinema" -> null
-       id                 = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema/nodePools/core" -> null
-       initial_node_count = 2 -> null
-       location           = "us-central1" -> null
-       name               = "core" -> null
-       node_locations     = [
-           "us-central1-a",
        ] -> null
-       project            = "wayofthesys-cinema" -> null

-       autoscaling {
-           max_node_count       = 4 -> null
-           min_node_count       = 2 -> null
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

-       management {
-           auto_repair  = true -> null
-           auto_upgrade = true -> null
        }

-       node_config {
-           disk_size_gb      = 10 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "cinema"
-               "node_pool"    = "core"
            } -> null
-           local_ssd_count   = 1 -> null
-           machine_type      = "n2-highcpu-16" -> null
-           metadata          = {
-               "cluster_name"             = "cinema"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "core"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = true -> null
-           service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-cinema",
-               "gke-cinema-core",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       timeouts {
-           create = "45m" -> null
-           delete = "45m" -> null
-           update = "45m" -> null
        }

-       upgrade_settings {
-           max_surge       = 1 -> null
-           max_unavailable = 0 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@wayofthesys-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns will be created
+   resource "google_service_account_key" "external-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "wayofthesys-cinema"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] will be created
+   resource "google_gke_hub_membership" "membership" {
+       id            = (known after apply)
+       membership_id = (known after apply)
+       name          = (known after apply)
+       project       = "wayofthesys-cinema"

+       endpoint {
+           gke_cluster {
+               resource_link = (known after apply)
            }
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 2
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       operation                   = (known after apply)
+       project                     = "wayofthesys-cinema"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 4
+           min_node_count = 2
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 10
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "c2d-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] will be created
+   resource "null_resource" "additional_components" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

Plan: 8 to add, 2 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
